;;; -*- Mode: Emacs-Lisp ; Coding: utf-8-unix -*-
;;; last updated : 2012/03/26.17:34:55

;;==============================================================================
;; lua Mode setup
;;==============================================================================


;; 呼び出すモードおよび、関連ずける関数の定義を記述
;(defun html-mode-hook-functions ()
;    (turn-on-font-lock)
;)


;;------------------------------------------------------------------------------
;; Suffixes <---> Mode  Connection                                              
;;------------------------------------------------------------------------------


(setq auto-mode-alist
      (
       cons '("\\.lua$" . lua-mode)
	    auto-mode-alist)
)

;; Load Module
(autoload 'lua-mode "lua-mode" "Lua Edit Mode" t)





(provide 'setup.lua-mode)
;;------------------------------------------------------------------------------
;; EOF
