;;; -*- Mode: Emacs-Lisp ; Coding: utf-8-unix -*-
;;; last updated : 2012/09/04.04:45:10

;;==============================================================================
;; Frame Environment                                                            
;;==============================================================================


;;------------------------------------------------------------------------------
;; Common Environment                                                           
;;------------------------------------------------------------------------------


;; フレーム環境へ追加

;; フレームカラー、カーソルカラーなどface系は Emacs Color Themeでセットされるのでここではセットしない

; 行間の間隔
(add-to-list 'default-frame-alist '(line-space . 4))

; 垂直スクロールバーの有無
(add-to-list 'default-frame-alist '(vertical-scroll-bars . t))

; 水平スクロールバーの有無（実装されていない）
(add-to-list 'default-frame-alist '(horizontal-scroll-bars . t))



;;------------------------------------------------------------------------------
;; frame split behavior
;;------------------------------------------------------------------------------


;; buffer-menuなど呼び出し時にフレームを自動分割する際の挙動

;; 横方向へ伸びた場合に垂直方向へ分割する閾値(有効化する場合はframeサイズを入れる)
(setq split-width-threshold nil)

;; 縦方向へ伸びた場合に水平方向へ分割する閾値(有効化する場合はframeサイズを入れる)
(setq split-height-threshold nil)



;;------------------------------------------------------------------------------
;; mode-line                                                                    
;;------------------------------------------------------------------------------


;; タイムロケール設定
(setq system-time-locale "C")
;(setq system-time-locale "English")


;; 表示項目：日時表示
(setq display-time-day-and-date t)

;; 表示項目：時間を２４時間表記
(setq display-time-24hr-format t)

;; 表示項目：表示フォーマット
(setq display-time-format "%Y-%m-%d (%a) %H:%M")

;; 時間表示を有効化
;; 関数をコールする前に変数に値をセットしておくこと
;; 関数がコールされた時にセットされていないと設定は反映されない
(display-time)


;; 現在の行番号を表示
(line-number-mode t)

;; カラム番号を表示する
(column-number-mode t)



;;------------------------------------------------------------------------------
;; Misc                                                                         
;;------------------------------------------------------------------------------


;; メニューバーを表示
(menu-bar-mode t)

;; ツールバーを表示(0:disable, 1:enable)
(tool-bar-mode 0)

;; 垂直スクロールバー表示位置 nil/'left/'right
(set-scroll-bar-mode 'left)



;;------------------------------------------------------------------------------
;; Local Environment                                                            
;;------------------------------------------------------------------------------

(let ((self-file-name "frame.config"))
    (deu:load-library-auto-select-platform-path self-file-name path-basic-configuration)
)



;;------------------------------------------------------------------------------
;; Entry Initialize Frame Parameters                                            
;;------------------------------------------------------------------------------





(provide 'frame.config)
;;------------------------------------------------------------------------------
;; EOF
