;;; -*- Mode: Emacs-Lisp ; Coding: utf-8-unix -*-
;;; last updated : 2012/03/30.03:58:28

;;==============================================================================
;; misc library setup
;;==============================================================================

;; require only modules

;; jka-compr(tar, zip 等はパスが通っている場所にあること), 圧縮したファイルを普通のファイルと同様 に扱うためのライブラリ
(require 'jka-compr)





(provide 'misc.config)
;;------------------------------------------------------------------------------
;; EOF
