;;; -*- mode: emacs-lisp ; coding: utf-8-unix -*-
;;; last updated : 2012/09/25.20:28:45


;;==============================================================================
;; misc library setup
;;==============================================================================

;; require only modules

;; jka-compr(tar, zip 等はパスが通っている場所にあること), 圧縮したファイルを普通のファイルと同様 に扱うためのライブラリ
(require 'jka-compr)





(provide 'misc.config)
;;------------------------------------------------------------------------------
;; EOF
